module.exports.clockify = seconds => {
  let h = Math.floor(seconds / 3600);
  let m = (Math.floor(seconds / 60) % 60);
  let s = (seconds % 60);
  if ((m + "").length === 1) m = `0${m}`;
  if ((s + "").length === 1) s = `0${s}`;
  return ((h > 0) ? `${h}:${m}:${s}` : `${m}:${s}`);
};
module.exports.obfuscate = (() => {
  var nums = JSON.parse("[\"⁰₀⓪⓿🄋🄌𝟎𝟘𝟢𝟬𝟶０🄁🄀\",\"¹₁①⑴⓵❶➊➀𝟏𝟙𝟣𝟭𝟷１🄂⒈\",\"²₂②⑵⓶❷➋➁𝟐𝟚𝟤𝟮𝟸↊２🄃⒉\",\"³₃③⑶⓷❸➌➂𝟑𝟛𝟥𝟯𝟹↋３🄄⒊\",\"⁴₄④⑷⓸❹➍➃𝟒𝟜𝟦𝟰𝟺４🄅⒋\",\"⁵₅⑤⑸⓹❺➎➄𝟓𝟝𝟧𝟱𝟻５🄆⒌\",\"⁶₆⑥⑹⓺❻➏➅𝟔𝟞𝟨𝟲𝟼６🄇⒍\",\"⁷₇⑦⑺⓻❼➐➆𝟕𝟟𝟩𝟳𝟽７🄈⒎\",\"⁸₈⑧⑻⓼❽➑➇𝟖𝟠𝟪𝟴𝟾８🄉⒏\",\"⁹₉⑨⑼⓽❾➒➈𝟗𝟡𝟫𝟵𝟿９🄊⒐\"]");
function utfarray(txt) {
  var list = [];
  for(var i=0;i<txt.length;i++) {
    var num = txt.charCodeAt(i);
    if(num >= 55296 && num <= 56319) {
      var num2 = txt.charCodeAt(i+1);
      num = ((num-55296)*1024) + (num2-56320) + 65536;
      list.push(num);
      i++;
    } else {
      list.push(num);
    }
  }
  return list;
} function substitute(num) {
  if(num >= 48 && num <= 57 && nums[num-48] != '') {
    var arr = utfarray(nums[num-48]);
    return arr[rand(arr.length)];
  } else if(num >= 65 && num <= 90 && lets[num-65] != '') {
    var arr = utfarray(emoji(lets[num-65]));
    return arr[rand(arr.length)];
  } else if(num >= 97 && num <= 122 && lets[num-97] != '') {
    var arr = utfarray(emoji(lets[num-97]));
    return arr[rand(arr.length)];
  } else {
    return num;
  }
} function emoji(str) {
   return str;
} function character(num) {
  if(num >= 65536 && num <= 1114111) {
    var num1 = Math.floor((num - 65536) / 1024) + 55296;
    var num2 = ((num - 65536) % 1024) + 56320;
    return String.fromCharCode(num1) + String.fromCharCode(num2);
  } else {
    return String.fromCharCode(num);
  }
} 
function rand(n,z) {
  var s = (!z) ? 0 : z;
  return Math.floor(Math.random() * (n - s) + s);
};
var lets = JSON.parse("[\"ªᴀᴬᵃᵅₐ⒜Ⓐⓐ🄐🄰🅐🅰𝐀𝐚𝐴𝑎𝑨𝒂𝒜𝒶𝓐𝓪𝔄𝔞𝔸𝕒𝕬𝖆𝖠𝖺𝗔𝗮𝘈𝘢𝘼𝙖𝙰𝚊𝚨𝛂𝛢𝛼𝜜𝜶𝝖𝝰𝞐𝞪ÀÁÂÃÄÅàáâãäåĀāĂăĄąǍǎǞǟǠǡǺǻȀȁȂȃȦȧȺΆάӐӑӒӓᶏᶐḀḁẚẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặἀἁἂἃἄἅἆἇἈἉἊἋἌἍἎἏὰάᾀᾁᾂᾃᾄᾅᾆᾇᾈᾉᾊᾋᾌᾍᾎᾏᾰᾱᾲᾳᾴᾶᾷᾸᾹᾺΆᾼⱥɐɒᗄᵄᶛ∀ⱯⱰꓯɑΑαАаᎪᗅÅ⍶⍺ꓮＡａ𐊠𐌀𐐟\",\"ʙᴮᵇᵝᵦꚜꚝ⒝Ⓑⓑ🄑🄱🅑🅱ℬ𝐁𝐛𝐵𝑏𝑩𝒃𝒷𝓑𝓫𝔅𝔟𝔹𝕓𝕭𝖇𝖡𝖻𝗕𝗯𝘉𝘣𝘽𝙗𝙱𝚋𝚩𝛃𝛣𝛽𝜝𝜷𝝗𝝱𝞑𝞫ƀƁƂƃɃɓᴃᴯᵬᶀḂḃḄḅḆḇꞖꞗßƄƅΒβϐБВЬъьѢѣҌҍᏏᏰᏴᖯᗷᛒꓐꞴꞵＢｂ𐊂𐊡𐌁𐌜𝇒\",\"ᴄᴐᵓᶜ⒞Ⓒⓒ🄒🄫🄲🅒🅲ℂℭ𝐂𝐜𝐶𝑐𝑪𝒄𝒞𝒸𝓒𝓬𝔠𝕔𝕮𝖈𝖢𝖼𝗖𝗰𝘊𝘤𝘾𝙘𝙲𝚌ÇçĆćĈĉĊċČčƇƈȻȼɕҪҫᶝḈḉꞒꞓꞔƆɔͻϽϿↃↄꓛꜾꜿ𐑋¢ʗϲϹСсᏟᑦ₡℃ⅭⅽⲤⲥꓚＣｃ￠𐊢𐌂𐐕𐐣𐐽🝌\",\"ᴅᴰᵈ⒟Ⓓⓓ🄓🄳🅓🅳ⅅⅆ𝐃𝐝𝐷𝑑𝑫𝒅𝒟𝒹𝓓𝓭𝔇𝔡𝔻𝕕𝕯𝖉𝖣𝖽𝗗𝗱𝘋𝘥𝘿𝙙𝙳𝚍ĎďĐđƊƋƌȡɖɗᵭᶁᶑḊḋḌḍḎḏḐḑḒḓÐƉԁᎠᏧᑯᑺᑻᒇᖁᗞᗪ₫ⅮⅾꓒꓓＤｄ𐌃\",\"ᴇᴱᵉᵊᵋᶾₑₔ⒠Ⓔⓔ🄔🄴🅔🅴ℯℰⅇ𝐄𝐞𝐸𝑒𝑬𝒆𝓔𝓮𝔈𝔢𝔼𝕖𝕰𝖊𝖤𝖾𝗘𝗲𝘌𝘦𝙀𝙚𝙴𝚎𝚬𝛆𝛜𝛦𝜀𝜖𝜠𝜺𝝐𝝚𝝴𝞊𝞔𝞮𝟄ÈÉÊËèéêëĒēĔĕĖėĘęĚěǯȄȅȆȇȨȩɆɇɚΈέЀѐҙҿӖӗӚӛӟӬӭᶒᶓḔḕḖḗḘḙḚḛḜḝẸẹẺẻẼẽẾếỀềỂểỄễỆệἐἑἒἓἔἕἘἙἚἛἜἝὲέῈΈ⋴ⱸꬳꬴƎƏǝȝɘəɜɝʒЭзэӘәӡԐԑჳᴈᴲᵌᶔᶟ∃∄ⱻⳍⴺꓱꝫꞫƐɛΕεϵЁЄЕеёєҽᎬᏋ€ℇ℮⋿⍷ⲈⲉⴹꓰꬲＥｅ𐊆𐌄𐐁𐐩\",\"ᶠꜰ⒡Ⓕⓕ🄕🄵🅕🅵ℱ𝐅𝐟𝐹𝑓𝑭𝒇𝒻𝓕𝓯𝔉𝔣𝔽𝕗𝕱𝖋𝖥𝖿𝗙𝗳𝘍𝘧𝙁𝙛𝙵𝚏𝟊ƑƒᵮᶂḞḟẛẜẝꞘꞙℲⅎꟻſϜᖴ℉ꓝꝻꝼꬵＦｆ𐊇𐊥𐌅𐔥\",\"ɢᴳᵍᶢ⒢Ⓖⓖ🄖🄶🅖🅶ɡℊꞬ𝐆𝐠𝐺𝑔𝑮𝒈𝒢𝓖𝓰𝔊𝔤𝔾𝕘𝕲𝖌𝖦𝗀𝗚𝗴𝘎𝘨𝙂𝙜𝙶𝚐ĜĝĞğĠġĢģƓǤǥǦǧǴǵɠʛᶃḠḡꞠꞡꬶƍᵷ⅁ԌցᏀᏳꓖＧｇ\",\"ʜʰᴴₕ⒣Ⓗⓗ🄗🄷🅗🅷ℋℌℍℎℏ𝐇𝐡𝐻𝑯𝒉𝒽𝓗𝓱𝔥𝕙𝕳𝖍𝖧𝗁𝗛𝗵𝘏𝘩𝙃𝙝𝙷𝚑𝚮𝛨𝜢𝝜𝞖ĤĥĦħȞȟɦʱΉҢӇӉḢḣḤḥḦḧḨḩḪḫẖἨἩἪἫἬἭἮἯᾘᾙᾚᾛᾜᾝᾞᾟῊΉῌⱧⱨꞕꞪꟸɥʮʯᶣꞍΗНћҺһհᎻᏂᏲᑋᕼᚺᚻⲎꓧꚕＨｈ𐋏\",\"ɪᴵᵢᶥᶦⁱ⒤Ⓘⓘ🄘🄸🅘🅸ℐℑⅈ𝐈𝐢𝐼𝑖𝑰𝒊𝒾𝓘𝓲𝔦𝕀𝕚𝕴𝖎𝖨𝗂𝗜𝗶𝘐𝘪𝙄𝙞𝙸𝚒𝚤𝛊𝜄𝜾𝝸𝞲ÌÍÎÏìíîïĨĩĪīĬĭĮįİƗǏǐȈȉȊȋɨᵻᵼᶖᶤᶧḬḭḮḯỈỉỊịᴉᵎꟷıɩІЇіїӀӏᎥℹⅠⅰ⍳⍸ꓲꙇꟾꭵＩｉￜ𐌆𐌉𐌠\",\"ʲᴊᴶⱼ⒥Ⓙⓙ🄙🄹🅙🅹ⅉ𝐉𝐣𝐽𝑗𝑱𝒋𝒥𝒿𝓙𝓳𝔍𝔧𝕁𝕛𝕵𝖏𝖩𝗃𝗝𝗷𝘑𝘫𝙅𝙟𝙹𝚓𝚥ĴĵǰɈɉɟʄʝᶡᶨꞲ℩ȷͿϳЈјյᎫᒍᒘᒙꓙＪｊ\",\"ᴋᴷᵏₖ⒦Ⓚⓚ🄚🄺🅚🅺𝐊𝐤𝐾𝑘𝑲𝒌𝒦𝓀𝓚𝓴𝔎𝔨𝕂𝕜𝕶𝖐𝖪𝗄𝗞𝗸𝘒𝘬𝙆𝙠𝙺𝚔𝚱𝛋𝛞𝛫𝜅𝜘𝜥𝜿𝝒𝝟𝝹𝞌𝞙𝞳𝟆ĶķƘƙǨǩҚқҞҟᶄḰḱḲḳḴḵⱩⱪꝀꝁꝂꝃꝄꝅʞĸΚκϰЌКкќᏦᛕ₭KⲔⲕꓗＫｋ𐌊𐔘\",\"ʟˡᴸᶫₗ⒧Ⓛⓛ🄛🄻🅛🅻ℒℓ𝐋𝐥𝐿𝑙𝑳𝒍𝓁𝓛𝓵𝔏𝔩𝕃𝕝𝕷𝖑𝖫𝗅𝗟𝗹𝘓𝘭𝙇𝙡𝙻𝚕ĹĺĻļĽľĿŀŁłƚȴȽɫɬɭᴌᶅᶩᶪḶḷḸḹḺḻḼḽⱠⱡⱢꝈꝉꞎꞭꬷꬸꬹꭝꭞ⅂⅃ꞀꞁᏞᒪᒶᣳⅬⅼⳐꓡꝆꝇＬｌ𐌋𐐛𐔦\",\"ᴍᴹᵐₘ⒨Ⓜⓜ㎡🄜🄼🅜🅼ℳ𝐌𝐦𝑀𝑚𝑴𝒎𝓂𝓜𝓶𝔐𝔪𝕄𝕞𝕸𝖒𝖬𝗆𝗠𝗺𝘔𝘮𝙈𝙢𝙼𝚖𝚳𝛭𝜧𝝡𝞛ɱӍӎᵯᶆᶬḾḿṀṁṂṃⱮꬺƜɯɰպᴟᵚᶭꟺꟽꭑΜϺМмᎷᗰᛖᛗ₥ⅯⅿⲘ㎥ꓟꟿＭｍ𐊎𐊰𐌑\",\"ɴᴨᴺᶰⁿₙ⒩Ⓝⓝ🄝🄽🅝🅽ℕ𝐍𝐧𝑁𝑛𝑵𝒏𝒩𝓃𝓝𝓷𝔑𝔫𝕟𝕹𝖓𝖭𝗇𝗡𝗻𝘕𝘯𝙉𝙣𝙽𝚗𝚴𝛈𝛑𝛮𝜂𝜋𝜨𝜼𝝅𝝢𝝶𝝿𝞏𝞜𝞰𝞹ÑñŃńŅņŇňƝƞǸǹȠȵɲɳήᵰᶇᶮᶯṄṅṆṇṈṉṊṋἠἡἢἣἤἥἦἧὴήᾐᾑᾒᾓᾔᾕᾖᾗῂῃῄῆῇꞐꞑꞤꞥꬻᴎᴻŉΝηпոռⲚꓠＮｎ𐔓\",\"ºᴏᴼᵒₒ⍥⒪Ⓞⓞ🄞🄾🅞🅾ℴ𝐎𝐨𝑂𝑜𝑶𝒐𝒪𝓞𝓸𝔒𝔬𝕆𝕠𝕺𝖔𝖮𝗈𝗢𝗼𝘖𝘰𝙊𝙤𝙾𝚘𝚶𝛐𝛔𝛰𝜊𝜎𝜪𝝄𝝈𝝤𝝾𝞂𝞞𝞸𝞼ÒÓÔÕÖØòóôõöøŌōŎŏŐőƟƠơǑǒǪǫǬǭǾǿȌȍȎȏȪȫȬȭȮȯȰȱɵΌόӦӧӨөӪӫᶱṌṍṎṏṐṑṒṓỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợὀὁὂὃὄὅὈὉὊὋὌὍὸόῸΌⱺꝊꝋꝌꝍꬾᴑᴓΟοσОоѳҨҩՕօଠഠဝჿᎤⲞⲟⵁⵔ〇ꓳꙨꙩꙪꙫꙬꙭꚚꚛꬽＯｏ𐊒𐊫𐌏𐐄𐐬𐔖\",\"ᴘᴾᵖᵨₚ⒫Ⓟⓟ🄟🄿🅟🅿🆊℘ℙ𝐏𝐩𝑃𝑝𝑷𝒑𝒫𝓅𝓟𝓹𝔓𝔭𝕡𝕻𝖕𝖯𝗉𝗣𝗽𝘗𝘱𝙋𝙥𝙿𝚙𝚸𝛒𝛠𝛲𝜌𝜚𝜬𝝆𝝔𝝦𝞀𝞎𝞠𝞺𝟈ƤƥᵱᵽᶈṔṕṖṗῤῥῬⱣꝐꝑꝒꝓꝔꝕꟼΡρϱРрᏢᑭᑶᑷᒆᕿ℗⍴ⲢⲣꓑＰｐ𐊕𐌓𐌛\",\"⒬Ⓠⓠ🄠🅀🅠🆀ℚ𝐐𝐪𝑄𝑞𝑸𝒒𝒬𝓆𝓠𝓺𝔔𝔮𝕢𝕼𝖖𝖰𝗊𝗤𝗾𝘘𝘲𝙌𝙦𝚀𝚚ɊɋʠꝖꝗꝘꝙ℺ԛգզⵕＱｑ𐌒\",\"ʀʳᴦᴿᵣ⒭Ⓡⓡ🄡🄬🅁🅡🆁ℛℜℝ𝐑𝐫𝑅𝑟𝑹𝒓𝓇𝓡𝓻𝔯𝕣𝕽𝖗𝖱𝗋𝗥𝗿𝘙𝘳𝙍𝙧𝚁𝚛ŔŕŖŗŘřȐȑȒȓɌɍɼɽɾґғᵲᵳᶉṘṙṚṛṜṝṞṟⱤꞦꞧꭆꭇꭉꭊɹɺɻɿʁʴʵʶᴙᴚⱹꓤꞞƦгѓᎡᏒᖇᚱᣴⲅꓣꞂꞃꞄꞅꭈＲｒ\",\"ˢₛꜱ⒮Ⓢⓢ⦞⧌🄢🄪🅂🅢🆂𝐒𝐬𝑆𝑠𝑺𝒔𝒮𝓈𝓢𝓼𝔖𝔰𝕊𝕤𝕾𝖘𝖲𝗌𝗦𝘀𝘚𝘴𝙎𝙨𝚂𝚜ŚśŜŝŞşŠšȘșȿʂᵴᶊᶳṠṡṢṣṤṥṦṧṨṩⱾꞨꞩƨϩᴤ∾ꙅƽЅѕՏᏕᏚᔆᣵꓢＳｓ𐊖𐌔𐐠𐑈\",\"ᴛᵀᵗₜ⒯Ⓣⓣ🄣🅃🅣🆃𝐓𝐭𝑇𝑡𝑻𝒕𝒯𝓉𝓣𝓽𝔗𝔱𝕋𝕥𝕿𝖙𝖳𝗍𝗧𝘁𝘛𝘵𝙏𝙩𝚃𝚝𝚻𝛕𝛵𝜏𝜯𝝉𝝩𝞃𝞣𝞽ŢţŤťŦŧƫƬƭƮȚțȶȾʈҬҭᵵᶵṪṫṬṭṮṯṰṱẗⱦʇ⊥⟂ꓕꞱΤτТтᎢᎿ₮⊤⍡⟙ⲦꓔＴｔ𐊗𐊱𐌕🝨\",\"ᴜᵁᵘᵤᶸ⒰Ⓤⓤ🄤🅄🅤🆄𝐔𝐮𝑈𝑢𝑼𝒖𝒰𝓊𝓤𝓾𝔘𝔲𝕌𝕦𝖀𝖚𝖴𝗎𝗨𝘂𝘜𝘶𝙐𝙪𝚄𝚞𝛖𝜐𝝊𝞄𝞾ÙÚÛÜùúûüŨũŪūŬŭŮůŰűŲųƯưǓǔǕǖǗǘǙǚǛǜȔȕȖȗɄʉΰϋύᵾᶙᶶṲṳṴṵṶṷṸṹṺṻỤụỦủỨứỪừỬửỮữỰựὐὑὒὓὔὕὖὗὺύῠῡῢΰῦῧꭎꭒꭟᴝᴞᵙυцՍսᏌᑌᑗᑘᑧ∪⋃ꓴꞟＵｕ\",\"ᴠᴧᵛᵥⱽ⒱Ⓥⓥ🄥🅅🅥🆅𝐕𝐯𝑉𝑣𝑽𝒗𝒱𝓋𝓥𝓿𝔙𝔳𝕍𝕧𝖁𝖛𝖵𝗏𝗩𝘃𝘝𝘷𝙑𝙫𝚅𝚟𝚲𝛎𝛬𝜈𝜦𝝂𝝠𝝼𝞚𝞶ƲʋѶѷᶌᶹṼṽṾṿⱱⱴꝞꝟטּɅʌΛ٨۸ᐱᐼᐽᶺⴷꓥ𐊍𐌡νѴѵ٧۷ᏙᐯᐺᐻⅤⅴ∨⋁ⴸꓦＶｖ𐔝\",\"ʷᴡᵂ⒲Ⓦⓦ🄦🅦🆆𝐖𝐰𝑊𝑤𝑾𝒘𝒲𝓌𝓦𝔀𝔚𝔴𝕎𝕨𝖂𝖜𝖶𝗐𝗪𝘄𝘞𝘸𝙒𝙬𝚆𝚠𝛚𝜔𝝎𝞈𝟂ŴŵώẀẁẂẃẄẅẆẇẈẉẘὠὡὢὣὤὥὦὧὼώᾠᾡᾢᾣᾤᾥᾦᾧῲῳῴῶῷⱲⱳʍωѡԜԝաᎳᏔ₩⍵ⲱꓪꙍꞷＷｗ￦\",\"ˣᵡᵪₓ⌧⒳Ⓧⓧ☒✗✘⦻⮽⮾⮿🄧🅇🅧🆇🖾🗴🗵🗶🗷𝐗𝐱𝑋𝑥𝑿𝒙𝒳𝓍𝓧𝔁𝔛𝔵𝕏𝕩𝖃𝖝𝖷𝗑𝗫𝘅𝘟𝘹𝙓𝙭𝚇𝚡𝚾𝛘𝛸𝜒𝜲𝝌𝝬𝞆𝞦𝟀ҲᶍẊẋẌẍ⨰ꭕꭖꭗꭘꭙ×ΧχХхᕁᕽ᙭᙮ᚷⅩⅹ╳✕✖⤫⤬⨯ⲬⲭⵝꓫꞳꭓＸｘ𐊐𐊴𐌗𐌢𐔧🗙\",\"ʏʸˠᵞᵧ⒴Ⓨⓨ🄨🅈🅨🆈ℽ𝐘𝐲𝑌𝑦𝒀𝒚𝒴𝓎𝓨𝔂𝔜𝔶𝕐𝕪𝖄𝖞𝖸𝗒𝗬𝘆𝘠𝘺𝙔𝙮𝚈𝚢𝚼𝛄𝛶𝛾𝜰𝜸𝝪𝝲𝞤𝞬ÝýÿŶŷŸƳƴȲȳɎɏΎΫϒϓϔҰұӮӯӰӱӲӳẎẏẙỲỳỴỵỶỷỸỹỾỿὙὛὝὟῨῩῪΎꭚʎ⅄¥ɣΥγЎУуўҮүყᎩᎽⲨꓬＹｙ￥𐊲𐌖\",\"ᴢᶻ⒵Ⓩⓩ🄩🅉🅩🆉ℤℨ𝐙𝐳𝑍𝑧𝒁𝒛𝒵𝓏𝓩𝔃𝔷𝕫𝖅𝖟𝖹𝗓𝗭𝘇𝘡𝘻𝙕𝙯𝚉𝚣𝚭𝛧𝜡𝝛𝞕ŹźŻżŽžƵƶȤȥɀʐʑᵶᶎᶼᶽẐẑẒẓẔẕⱫⱬⱿΖᏃᙆᙇꓜꝢꝣＺｚ𐋵𝆎\"]");
var zalgos = JSON.parse("[[\"̍\",\"̎\",\"̄\",\"̅\",\"̿\",\"̑\",\"̆\",\"̐\",\"͒\",\"͗\",\"͑\",\"̇\",\"̈\",\"̊\",\"͂\",\"̓\",\"̈́\",\"͊\",\"͋\",\"͌\",\"̃\",\"̂\",\"̌\",\"͐\",\"̀\",\"́\",\"̋\",\"̏\",\"̒\",\"̓\",\"̔\",\"̽\",\"̉\",\"ͣ\",\"ͤ\",\"ͥ\",\"ͦ\",\"ͧ\",\"ͨ\",\"ͩ\",\"ͪ\",\"ͫ\",\"ͬ\",\"ͭ\",\"ͮ\",\"ͯ\",\"̾\",\"͛\",\"͆\",\"̚\"],[\"̕\",\"̛\",\"̀\",\"́\",\"͘\",\"̡\",\"̢\",\"̧\",\"̨\",\"̴\",\"̵\",\"̶\",\"͏\",\"͜\",\"͝\",\"͞\",\"͟\",\"͠\",\"͢\",\"̸\",\"̷\",\"͡\",\"҉\"],[\"̖\",\"̗\",\"̘\",\"̙\",\"̜\",\"̝\",\"̞\",\"̟\",\"̠\",\"̤\",\"̥\",\"̦\",\"̩\",\"̪\",\"̫\",\"̬\",\"̭\",\"̮\",\"̯\",\"̰\",\"̱\",\"̲\",\"̳\",\"̹\",\"̺\",\"̻\",\"̼\",\"ͅ\",\"͇\",\"͈\",\"͉\",\"͍\",\"͎\",\"͓\",\"͔\",\"͕\",\"͖\",\"͙\",\"͚\",\"̣\"]]"); var lig = JSON.parse("{\"10\":\"⑩㉈\",\"11\":\"⑪\",\"12\":\"⑫\",\"13\":\"⑬\",\"14\":\"⑭\",\"15\":\"⑮\",\"16\":\"⑯\",\"17\":\"⑰\",\"18\":\"⑱\",\"19\":\"⑲\",\"20\":\"⑳㉉\",\"21\":\"㉑\",\"22\":\"㉒\",\"23\":\"㉓\",\"24\":\"㉔\",\"25\":\"㉕\",\"26\":\"㉖\",\"27\":\"㉗\",\"28\":\"㉘\",\"29\":\"㉙\",\"30\":\"㉊㉚\",\"31\":\"㉛\",\"32\":\"㉜\",\"33\":\"㉝\",\"34\":\"㉞\",\"35\":\"㉟\",\"36\":\"㊱\",\"37\":\"㊲\",\"38\":\"㊳\",\"39\":\"㊴\",\"40\":\"㉋㊵\",\"41\":\"㊶\",\"42\":\"㊷\",\"43\":\"㊸\",\"44\":\"㊹\",\"45\":\"㊺\",\"46\":\"㊻\",\"47\":\"㊼\",\"48\":\"㊽\",\"49\":\"㊾\",\"50\":\"㉌㊿\",\"60\":\"㉍\",\"70\":\"㉎\",\"80\":\"㉏\",\"1234\":\"🔢\",\"rads2\":\"㎯\",\"1/10\":\"⅒\",\"VIII\":\"Ⅷ\",\"viii\":\"ⅷ\",\"(10)\":\"⑽\",\"(11)\":\"⑾\",\"(12)\":\"⑿\",\"(13)\":\"⒀\",\"(14)\":\"⒁\",\"(15)\":\"⒂\",\"(16)\":\"⒃\",\"(17)\":\"⒄\",\"(18)\":\"⒅\",\"(19)\":\"⒆\",\"(20)\":\"⒇\",\"kcal\":\"㎉\",\"rads\":\"㎮\",\"15ma\":\"𝄸\",\"15mb\":\"𝄹\",\"COOL\":\"🆒\",\"FREE\":\"🆓\",\"BACK\":\"🔙\",\"SOON\":\"🔜\",\"ABCD\":\"🔠\",\"abcd\":\"🔡\",\"1/4\":\"¼\",\"1/2\":\"½\",\"3/4\":\"¾\",\"Pts\":\"₧\",\"Tel\":\"℡\",\"FAX\":\"℻\",\"1/7\":\"⅐\",\"1/9\":\"⅑\",\"1/3\":\"⅓\",\"2/3\":\"⅔\",\"1/5\":\"⅕\",\"2/5\":\"⅖\",\"3/5\":\"⅗\",\"4/5\":\"⅘\",\"1/6\":\"⅙\",\"5/6\":\"⅚\",\"1/8\":\"⅛\",\"3/8\":\"⅜\",\"5/8\":\"⅝\",\"7/8\":\"⅞\",\"III\":\"Ⅲ\",\"VII\":\"Ⅶ\",\"XII\":\"Ⅻ\",\"iii\":\"ⅲ\",\"vii\":\"ⅶ\",\"xii\":\"ⅻ\",\"0/3\":\"↉\",\"NUL\":\"␀\",\"SOH\":\"␁\",\"STX\":\"␂\",\"ETX\":\"␃\",\"ENQ\":\"␄\",\"EOT\":\"␅\",\"ACK\":\"␆\",\"BEL\":\"␇\",\"DLE\":\"␐\",\"DC1\":\"␑\",\"DC2\":\"␒\",\"DC3\":\"␓\",\"DC4\":\"␔\",\"NAK\":\"␕\",\"SYN\":\"␖\",\"ETB\":\"␗\",\"CAN\":\"␘\",\"SUB\":\"␚\",\"ESC\":\"␛\",\"DEL\":\"␡\",\"(1)\":\"⑴\",\"(2)\":\"⑵\",\"(3)\":\"⑶\",\"(4)\":\"⑷\",\"(5)\":\"⑸\",\"(6)\":\"⑹\",\"(7)\":\"⑺\",\"(8)\":\"⑻\",\"(9)\":\"⑼\",\"10.\":\"⒑\",\"11.\":\"⒒\",\"12.\":\"⒓\",\"13.\":\"⒔\",\"14.\":\"⒕\",\"15.\":\"⒖\",\"16.\":\"⒗\",\"17.\":\"⒘\",\"18.\":\"⒙\",\"19.\":\"⒚\",\"20.\":\"⒛\",\"(a)\":\"⒜\",\"(b)\":\"⒝\",\"(c)\":\"⒞\",\"(d)\":\"⒟\",\"(e)\":\"⒠\",\"(f)\":\"⒡\",\"(g)\":\"⒢\",\"(h)\":\"⒣\",\"(i)\":\"⒤\",\"(j)\":\"⒥\",\"(k)\":\"⒦\",\"(l)\":\"⒧\",\"(m)\":\"⒨\",\"(n)\":\"⒩\",\"(o)\":\"⒪\",\"(p)\":\"⒫\",\"(q)\":\"⒬\",\"(r)\":\"⒭\",\"(s)\":\"⒮\",\"(t)\":\"⒯\",\"(u)\":\"⒰\",\"(v)\":\"⒱\",\"(w)\":\"⒲\",\"(x)\":\"⒳\",\"(y)\":\"⒴\",\"(z)\":\"⒵\",\"PTE\":\"㉐\",\"erg\":\"㋍\",\"LTD\":\"㋏\",\"hPa\":\"㍱\",\"bar\":\"㍴\",\"dm2\":\"㍸\",\"dm3\":\"㍹\",\"cal\":\"㎈\",\"kHz\":\"㎑\",\"MHz\":\"㎒\",\"GHz\":\"㎓\",\"THz\":\"㎔\",\"mm2\":\"㎟\",\"cm2\":\"㎠\",\"km2\":\"㎢\",\"mm3\":\"㎣\",\"cm3\":\"㎤\",\"km3\":\"㎦\",\"ms2\":\"㎨\",\"kPa\":\"㎪\",\"MPa\":\"㎫\",\"GPa\":\"㎬\",\"rad\":\"㎭\",\"ckg\":\"㏆\",\"log\":\"㏒\",\"mil\":\"㏕\",\"mol\":\"㏖\",\"PPM\":\"㏙\",\"gal\":\"㏿\",\"gva\":\"𝄶\",\"gvb\":\"𝄷\",\"Ted\":\"𝆮\",\"(A)\":\"🄐\",\"(B)\":\"🄑\",\"(C)\":\"🄒\",\"(D)\":\"🄓\",\"(E)\":\"🄔\",\"(F)\":\"🄕\",\"(G)\":\"🄖\",\"(H)\":\"🄗\",\"(I)\":\"🄘\",\"(J)\":\"🄙\",\"(K)\":\"🄚\",\"(L)\":\"🄛\",\"(M)\":\"🄜\",\"(N)\":\"🄝\",\"(O)\":\"🄞\",\"(P)\":\"🄟\",\"(Q)\":\"🄠\",\"(R)\":\"🄡\",\"(S)\":\"🄢\",\"(T)\":\"🄣\",\"(U)\":\"🄤\",\"(V)\":\"🄥\",\"(W)\":\"🄦\",\"(X)\":\"🄧\",\"(Y)\":\"🄨\",\"(Z)\":\"🄩\",\"PPV\":\"🅎\",\"NEW\":\"🆕\",\"SOS\":\"🆘\",\"UP!\":\"🆙\",\"END\":\"🔚\",\"ON!\":\"🔛\",\"TOP\":\"🔝\",\"ABC\":\"🔤\",\"SSS\":\"🝜\",\"ffi\":\"ﬃ\",\"ffl\":\"ﬄ\",\"AE\":\"ÆǢǼӔ\",\"ae\":\"æǣǽӕᴂꬱ\",\"IJ\":\"Ĳ\",\"ij\":\"ĳ\",\"OE\":\"Œɶꭁꭂ\",\"oe\":\"œᴔꭀ\",\"hv\":\"ƕ\",\"OI\":\"Ƣ\",\"oi\":\"ƣ\",\"ll\":\"ǁỻ\",\"DZ\":\"ǄǱ\",\"Dz\":\"ǅǲ\",\"dz\":\"ǆǳʣʤʥ\",\"LJ\":\"Ǉ\",\"Lj\":\"ǈ\",\"lj\":\"ǉ\",\"NJ\":\"Ǌ\",\"Nj\":\"ǋ\",\"nj\":\"ǌ\",\"db\":\"ȸ\",\"qp\":\"ȹ\",\"lz\":\"ɮʫ\",\"ts\":\"ʦʧ\",\"tc\":\"ʨ\",\"fn\":\"ʩ\",\"ls\":\"ʪ\",\"ww\":\"ʬ\",\"bl\":\"Ыы\",\"IE\":\"Ѥ\",\"ie\":\"ѥꭡ\",\"Oy\":\"Ѹ\",\"oy\":\"ѹ\",\"ue\":\"ᵫ\",\"th\":\"ᵺ\",\"??\":\"⁇\",\"?!\":\"⁈\",\"!?\":\"⁉\",\"CE\":\"₠\",\"Rs\":\"₨\",\"Dp\":\"₯\",\"lt\":\"₶\",\"ac\":\"℀\",\"as\":\"℁\",\"CL\":\"℄🆑\",\"co\":\"℅\",\"cu\":\"℆\",\"lb\":\"℔\",\"No\":\"№\",\"SM\":\"℠\",\"TM\":\"™\",\"1/\":\"⅟\",\"II\":\"Ⅱ\",\"IV\":\"Ⅳ\",\"VI\":\"Ⅵ\",\"IX\":\"Ⅸ\",\"XI\":\"Ⅺ\",\"ii\":\"ⅱ\",\"iv\":\"ⅳ\",\"vi\":\"ⅵ\",\"ix\":\"ⅸ\",\"xi\":\"ⅺ\",\"aa\":\"⎂ꜳ\",\"BS\":\"␈\",\"HT\":\"␉\",\"LF\":\"␊\",\"VT\":\"␋\",\"FF\":\"␌\",\"CR\":\"␍\",\"SS\":\"␎🅍\",\"SI\":\"␏\",\"EM\":\"␙\",\"FS\":\"␜\",\"GS\":\"␝\",\"RS\":\"␞\",\"US\":\"␟\",\"SP\":\"␠\",\"1.\":\"⒈\",\"2.\":\"⒉\",\"3.\":\"⒊\",\"4.\":\"⒋\",\"5.\":\"⒌\",\"6.\":\"⒍\",\"7.\":\"⒎\",\"8.\":\"⒏\",\"9.\":\"⒐\",\"Hg\":\"㋌\",\"eV\":\"㋎\",\"da\":\"㍲\",\"AU\":\"㍳Ꜷ\",\"oV\":\"㍵\",\"pc\":\"㍶\",\"dm\":\"㍷\",\"IU\":\"㍺\",\"pA\":\"㎀\",\"nA\":\"㎁\",\"uA\":\"㎂\",\"mA\":\"㎃\",\"kA\":\"㎄\",\"KB\":\"㎅\",\"MB\":\"㎆🝫\",\"GB\":\"㎇\",\"pF\":\"㎊\",\"nF\":\"㎋\",\"uF\":\"㎌\",\"ug\":\"㎍\",\"mg\":\"㎎\",\"kg\":\"㎏\",\"Hz\":\"㎐\",\"ul\":\"㎕\",\"ml\":\"㎖\",\"dl\":\"㎗\",\"kl\":\"㎘\",\"fm\":\"㎙\",\"nm\":\"㎚\",\"um\":\"㎛\",\"mm\":\"㎜\",\"cm\":\"㎝\",\"km\":\"㎞\",\"m2\":\"㎡\",\"m3\":\"㎥\",\"ms\":\"㎧㎳\",\"Pa\":\"㎩\",\"ps\":\"㎰\",\"ns\":\"㎱\",\"us\":\"㎲\",\"pV\":\"㎴\",\"nV\":\"㎵\",\"uV\":\"㎶\",\"mV\":\"㎷\",\"kV\":\"㎸\",\"MV\":\"㎹🅋\",\"pW\":\"㎺\",\"nW\":\"㎻\",\"uW\":\"㎼\",\"mW\":\"㎽\",\"kW\":\"㎾\",\"MW\":\"㎿\",\"kO\":\"㏀\",\"MO\":\"㏁\",\"am\":\"㏂\",\"Bq\":\"㏃\",\"cc\":\"㏄\",\"cd\":\"㏅\",\"Co\":\"㏇\",\"dB\":\"㏈\",\"Gy\":\"㏉\",\"ha\":\"㏊\",\"HP\":\"㏋\",\"in\":\"㏌\",\"KK\":\"㏍\",\"HM\":\"㏎\",\"kt\":\"㏏\",\"lm\":\"㏐\",\"ln\":\"㏑\",\"lx\":\"㏓\",\"mb\":\"㏔\",\"pH\":\"㏗\",\"pm\":\"㏘\",\"PR\":\"㏚\",\"sr\":\"㏛\",\"Sv\":\"㏜\",\"Wb\":\"㏝\",\"Vm\":\"㏞\",\"Am\":\"㏟\",\"Ib\":\"Ꙓ\",\"ib\":\"ꙓ\",\"IA\":\"ꙖꙜꙝ\",\"ia\":\"ꙗ\",\"OO\":\"ꙬꚘꝎ\",\"oo\":\"ꙭꚙꝏ\",\"TZ\":\"Ꜩ\",\"tz\":\"ꜩ\",\"AA\":\"Ꜳ\",\"AO\":\"Ꜵ\",\"ao\":\"ꜵ\",\"au\":\"ꜷ\",\"AV\":\"ꜸꜺ\",\"av\":\"ꜹꜻ\",\"AY\":\"Ꜽ\",\"ay\":\"ꜽ\",\"vy\":\"ꝡ\",\"ui\":\"ꭐ\",\"ce\":\"ꭢ\",\"uo\":\"ꭣ\",\"DS\":\"𝄉\",\"DC\":\"𝄊\",\"0.\":\"🄀\",\"0,\":\"🄁\",\"1,\":\"🄂\",\"2,\":\"🄃\",\"3,\":\"🄄\",\"4,\":\"🄅\",\"5,\":\"🄆\",\"6,\":\"🄇\",\"7,\":\"🄈\",\"8,\":\"🄉\",\"9,\":\"🄊\",\"CD\":\"🄭\",\"WZ\":\"🄮\",\"HV\":\"🅊\",\"SD\":\"🅌\",\"WC\":\"🅏🆏\",\"MC\":\"🅪\",\"MD\":\"🅫\",\"IC\":\"🆋\",\"PA\":\"🆌\",\"SA\":\"🆍\",\"AB\":\"🆎\",\"DJ\":\"🆐\",\"ID\":\"🆔\",\"NG\":\"🆖\",\"OK\":\"🆗\",\"VS\":\"🆚\",\"et\":\"🙰🙱\",\"ET\":\"🙲🙳\",\"QE\":\"🜀\",\"AR\":\"🜇\",\"XX\":\"🝪\",\"VB\":\"🝬\",\"ff\":\"ﬀ\",\"fi\":\"ﬁ\",\"fl\":\"ﬂ\",\"ft\":\"ﬅ\",\"st\":\"ﬆ\"}");
return function (input) {
  var inn = input;
  if(inn.length < 1) return;
  var chr = [];
  var debug = [];

  var flags = '';
    for(var i in lig) {
      var pat = new RegExp(i.replace(/([()\/!,.;?])/g,'\\\$1'),flags);
      var rep = utfarray(emoji(lig[i]));
      if(rep.length == 0) continue
      while(pat.test(inn)) inn = inn.replace(pat,character(rep[rand(rep.length)]))
    }

  var inn = utfarray(inn);
  var subs = true;
  var sall = false;
  var srnd = false;
  var spro = true;
  var spow = 0;
  for(var i=0;i<inn.length;i++){
    if(subs) {
      if(sall || (srnd && rand(2) == 1) || (spro && Math.pow(i,spow) > rand(Math.pow(inn.length,spow)))) {
        inn[i] = substitute(inn[i]);
      }
    }
    chr[i] = character(inn[i]);
  }
    var znum = 110;
    if(znum > 10000 || znum < 10) {
      znum = 100;
    }
    var zpro = true;
    var zpow = 1.01;
    var zalgo = [''];
zalgo = zalgo.concat(zalgos[0]);
    zalgo = zalgo.concat(zalgos[1]);
    zalgo = zalgo.concat(zalgos[2]);
    for(var i=0;i<znum;i++) {
      if(zpro) {
        var who = -1;
        while (who >= chr.length || who < 0) who = Math.floor(Math.log((Math.random() * Math.pow(zpow,chr.length)) + 1)/Math.log(zpow))
        chr[who] += zalgo[rand(zalgo.length)];
      } else {
        chr[rand(chr.length)] += zalgo[rand(zalgo.length)];
      }
    }

  return chr.join('');
}
})();
module.exports.getCommand = (prefix, content) => {
  return content
    .slice(prefix.length)
    .trim()
    .split(/ +/g).join(" ");
};
module.exports.forceHTTPS = (req, res, next) => {
  if (!req.secure) {
    return res.redirect("https://sprokket.glitch.me" + req.url)
  } else {
    next();
  };
};
module.exports.checkAuth = (req, ipToUser) => {
  if (!ipToUser[req.ip]) return true;
};